cask "ghostty"
brew "yazi"
brew "poppler"      # pdf -> image thumbnails
brew "ghostscript"  # extra pdf support
brew "chafa"        # fallback image->ANSI (not needed for kitty graphics, but handy)
brew "imagemagick"  # general conversions
cask "font-jetbrains-mono-nerd-font"
tap "1password/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "jesseduffield/lazygit"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Collection of portable C++ source libraries
brew "boost"
# XML-based font configuration API for X Windows
brew "fontconfig"
# GNU File, Shell, and Text utilities
brew "coreutils"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Command-line outline and bitmap font editor/converter
brew "fontforge"
# Command-line fuzzy finder written in Go
brew "fzf"
# Fast, simple fuzzy text selector with an advanced scoring algorithm
brew "fzy"
# GitHub command-line tool
brew "gh"
# Configurable static site generator
brew "hugo"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# X.509 and CMS library
brew "libksba"
# Command-line Git information tool
brew "onefetch"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Cross-platform application and UI framework
brew "qt"
# Scantailor (Advanced) : bookscan images processor
brew "scantailor"
# Evade the deadly Yeti on your jet-powered skis
brew "ski"
# Cross-shell prompt for astronauts
brew "starship"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# GPU-accelerated terminal emulator
cask "alacritty"
# 3D creation suite
cask "blender"
# Web browser focusing on privacy
cask "brave-browser"
# Reimagine your terminal
cask "fig"
# Web browser
cask "firefox"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# GPU-based terminal emulator
cask "kitty"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Open-source software for live streaming and screen recording
cask "obs"
# Control your tools with a few keystrokes
cask "raycast"
# PDF reader and note-taking application
cask "skim"
# Rust-based terminal
cask "warp"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Video communication and virtual meeting platform
cask "zoom"
